results/Scaleway/X64-15GB/mysqlbench.log
$ date
Sat Apr 29 19:17:07 UTC 2017

$ mysql -V
mysql  Ver 15.1 Distrib 10.0.29-MariaDB, for debian-linux-gnu (x86_64) using readline 5.2

$ mysql -u root -p -e "create database benchmark;"

$ sysbench --test=oltp --oltp-table-size=1000000 --mysql-db=benchmark --mysql-user=root --mysql-password=123456 prepare
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Creating table 'sbtest'...
Creating 1000000 records in table 'sbtest'...

$ sysbench --test=oltp --oltp-table-size=1000000 --mysql-db=benchmark --mysql-user=root --mysql-password=123456 --max-time=60 --oltp-read-only=on --max-requests=0 --num-threads=8 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 8

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 7 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            1036112
        write:                           0
        other:                           148016
        total:                           1184128
    transactions:                        74008  (1233.40 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 1036112 (17267.59 per sec.)
    other operations:                    148016 (2466.80 per sec.)

Test execution summary:
    total time:                          60.0033s
    total number of events:              74008
    total time taken by event execution: 479.7145
    per-request statistics:
         min:                                  1.66ms
         avg:                                  6.48ms
         max:                                642.51ms
         approx.  95 percentile:               9.09ms

Threads fairness:
    events (avg/stddev):           9251.0000/991.38
    execution time (avg/stddev):   59.9643/0.00


$ sysbench --test=oltp --oltp-table-size=10000000 --mysql-db=benchmark --mysql-user=root --mysql-password=123456 --max-time=60 --max-requests=0 --num-threads=16 --oltp-reconnect-mode=random run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            194236
        write:                           69370
        other:                           108673
        total:                           372279
    transactions:                        13870  (230.63 per sec.)
    deadlocks:                           4      (0.07 per sec.)
    read/write requests:                 263606 (4383.23 per sec.)
    other operations:                    108673 (1807.01 per sec.)

Test execution summary:
    total time:                          60.1397s
    total number of events:              13870
    total time taken by event execution: 960.9618
    per-request statistics:
         min:                                  1.94ms
         avg:                                 69.28ms
         max:                                428.05ms
         approx.  95 percentile:             193.09ms

Threads fairness:
    events (avg/stddev):           866.8750/27.84
    execution time (avg/stddev):   60.0601/0.05


$ sysbench --test=oltp --mysql-db=benchmark --mysql-user=root --mysql-password=123456 cleanup
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Dropping table 'sbtest'...
Done.

$ mysql -u root -p -e "drop database benchmark;"